config/pen/documents/notes/ws/fani/17.06.24/cplint-17.06.24.org
#+TITLE: cplint learning Day 1
#+DATE: <2024-06-17 Mon>
#+AUTHOR: Fani
#+KEYWORDS: cplint prolog

#+LATEX_HEADER: \usepackage[margin=0.5in]{geometry}
#+OPTIONS: toc:nil

* Installation
** 1) Install SWI prolog
https://www.swi-prolog.org/download/stable

** 2) Install cplint
It is explained here:
- http://friguzzi.github.io/cplint/_build/html/index.html

Run swipl:

#+BEGIN_SRC bash -n :i bash :async :results verbatim code :lang text
  swipl
#+END_SRC

Install the package (in the swipl console):

#+BEGIN_SRC text -n :async :results verbatim code :lang text
  pack_install(cplint).
#+END_SRC

I also had to make sure this runs, after installing cplint.

#+BEGIN_SRC text -n :async :results verbatim code :lang text
  pack_rebuild(bddem).
#+END_SRC

* cplint Documentation
http://friguzzi.github.io/cplint/_build/html/index.html

It looks like it's possible to use R with cplint:

#+BEGIN_SRC text -n :async :results verbatim code :lang text
  Using R¶

  You have to load library cplint_r (a SWI-Prolog pack) with

  :- use_module(library(cplint_r)).

  Then you can use predicates

  bar_r/1
  bar_r/2
  argbar_r/1

  that work as their C3.js counterpart but do not return the graph as an
  argument as the graph is printed with a different mechanism.

  You also have

  histogram_r(+List:list,+Options:list) is det
#+END_SRC

