config/pen/documents/notes/ws/fani/17.06.24/cplint-17.06.24.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-06-17 Mon 16:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>cplint learning Day 1</title>
<meta name="author" content="Fani" />
<meta name="keywords" content="cplint prolog" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">cplint learning Day 1</h1>

<div id="outline-container-org09546e4" class="outline-2">
<h2 id="org09546e4"><span class="section-number-2">1.</span> Installation</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org31eb6bf" class="outline-3">
<h3 id="org31eb6bf"><span class="section-number-3">1.1.</span> 1) Install SWI prolog</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<a href="https://www.swi-prolog.org/download/stable">https://www.swi-prolog.org/download/stable</a>
</p>
</div>
</div>

<div id="outline-container-org113673c" class="outline-3">
<h3 id="org113673c"><span class="section-number-3">1.2.</span> 2) Install cplint</h3>
<div class="outline-text-3" id="text-1-2">
<p>
It is explained here:
</p>
<ul class="org-ul">
<li><a href="http://friguzzi.github.io/cplint/_build/html/index.html">http://friguzzi.github.io/cplint/_build/html/index.html</a></li>
</ul>

<p>
I also had to make sure this runs, after installing cplint.
</p>

<div class="org-src-container">
<pre class="src src-text"><span class="linenr">1: </span>pack_rebuild(bddem).
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgbcf62de" class="outline-2">
<h2 id="orgbcf62de"><span class="section-number-2">2.</span> cplint Documentation</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="http://friguzzi.github.io/cplint/_build/html/index.html">http://friguzzi.github.io/cplint/_build/html/index.html</a>
</p>

<p>
It looks like it's possible to use R with cplint:
</p>

<div class="org-src-container">
<pre class="src src-text"><span class="linenr"> 1: </span>Using R¶
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span>You have to load library cplint_r (a SWI-Prolog pack) with
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>:- use_module(library(cplint_r)).
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>Then you can use predicates
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span>bar_r/1
<span class="linenr">10: </span>bar_r/2
<span class="linenr">11: </span>argbar_r/1
<span class="linenr">12: </span>
<span class="linenr">13: </span>that work as their C3.js counterpart but do not return the graph as an
<span class="linenr">14: </span>argument as the graph is printed with a different mechanism.
<span class="linenr">15: </span>
<span class="linenr">16: </span>You also have
<span class="linenr">17: </span>
<span class="linenr">18: </span>histogram_r(+List:list,+Options:list) is det
</pre>
</div>
</div>
</div>
