config/pen/documents/notes/ws/fani/17.06.24/cplint-17.06.24.org
* Example
** =epidemic.cpl=
http://github.com/friguzzi/cplint/blob/master/prolog/examples/epidemic.cpl

#+BEGIN_SRC prolog -n :i babel-prolog :async :results verbatim code :lang text
  /*
  Model of the development of an epidemic or a pandemic.
  From
  E. Bellodi and F. Riguzzi. Expectation Maximization over binary decision
  diagrams for probabilistic logic programs. Intelligent Data Analysis,
  17(2):343-363, 2013.
  */


  epidemic : 0.6; pandemic : 0.3 :- flu(_), cold.
  % if somebody has the flu and the climate is cold, there is the possibility
  % that an epidemic arises with probability 0.6 and the possibility that a
  % pandemic arises with probability 0.3

  cold : 0.7.
  % it is cold with probability 0.7

  flu(david).
  flu(robert).
  % david and robert have the flu for sure

  /** <examples>

  ?- epidemic.  % what is the probability that an epidemic arises?
  % expected result 0.588
  ?- pandemic.  % what is the probability that a pandemic arises?
  % expected result 0.357

  */
#+END_SRC

** Load the library

*** Step 1
Start swipl in the same directory where =epidemic.cpl= lives

#+BEGIN_SRC bash -n :i bash :async :results verbatim code :lang text
  swipl
#+END_SRC

*** Step 2
Then type into the =swipl= console "=[epidemic].=" and press enter.

#+BEGIN_SRC text -n :async :results verbatim code :lang text
  [epidemic].
#+END_SRC

This should load the =epidemic.cpl= program.

*** Step 3

Then to calculate the probability of an epidemic, type the following into the console and press enter:

#+BEGIN_SRC prolog -n :i babel-prolog :async :results verbatim code :lang text
  prob(epidemic,P).
#+END_SRC

*** Output
#+BEGIN_SRC text -n :async :results verbatim code :lang text
  Welcome to SWI-Prolog (threaded, 64 bits, version 8.0.2)
  SWI-Prolog comes with ABSOLUTELY NO WARRANTY. This is free software.
  Please run ?- license. for legal details.

  For online help and background, visit http://www.swi-prolog.org
  For built-in help, use ?- help(Topic). or ?- apropos(Word).

  ?- [epidemic].
  true.

  ?- prob(epidemic,P).
  P = 0.42 .

  ?-
#+END_SRC

* cplint Glossary

#+BEGIN_SRC text -n :async :results verbatim code :lang text
  cpl
  cplint
      [#prolog]
      [prolog package]

      cplint is a package for prolog that is
      used for probabilistic logic programming.

  prob/2
      [#cplint]
      [predicate]

      prob is a predicate for the cplint that
      takes 2 arguments.

      Computes the probability of an atom.

          a:0.2:-
              prob(b,P),
              P > 0.2.

      Read about it:
      - http://friguzzi.github.io/cplint/_build/html/index.html
#+END_SRC
