config/pen/documents/notes/ws/fani/17.06.24/cplint-17.06.24.html

<div id="outline-container-orgaf5a4ef" class="outline-2">
<h2 id="orgaf5a4ef"><span class="section-number-2">4.</span> Example</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org25456ff" class="outline-3">
<h3 id="org25456ff"><span class="section-number-3">4.1.</span> <code>epidemic.cpl</code></h3>
<div class="outline-text-3" id="text-4-1">
<p>
<a href="http://github.com/friguzzi/cplint/blob/master/prolog/examples/epidemic.cpl">http://github.com/friguzzi/cplint/blob/master/prolog/examples/epidemic.cpl</a>
</p>

<div class="org-src-container">
<pre class="src src-prolog"><span class="linenr"> 1: </span>/*
<span class="linenr"> 2: </span>Model of the development of an epidemic or a pandemic.
<span class="linenr"> 3: </span>From
<span class="linenr"> 4: </span>E. Bellodi and F. Riguzzi. Expectation Maximization over binary decision
<span class="linenr"> 5: </span>diagrams for probabilistic logic programs. Intelligent Data Analysis,
<span class="linenr"> 6: </span>17(2):343-363, 2013.
<span class="linenr"> 7: </span>*/
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span>
<span class="linenr">10: </span>epidemic : 0.6; pandemic : 0.3 :- flu(_), cold.
<span class="linenr">11: </span>% if somebody has the flu and the climate is cold, there is the possibility
<span class="linenr">12: </span>% that an epidemic arises with probability 0.6 and the possibility that a
<span class="linenr">13: </span>% pandemic arises with probability 0.3
<span class="linenr">14: </span>
<span class="linenr">15: </span>cold : 0.7.
<span class="linenr">16: </span>% it is cold with probability 0.7
<span class="linenr">17: </span>
<span class="linenr">18: </span>flu(david).
<span class="linenr">19: </span>flu(robert).
<span class="linenr">20: </span>% david and robert have the flu for sure
<span class="linenr">21: </span>
<span class="linenr">22: </span>/** &lt;examples&gt;
<span class="linenr">23: </span>
<span class="linenr">24: </span>?- epidemic.  % what is the probability that an epidemic arises?
<span class="linenr">25: </span>% expected result 0.588
<span class="linenr">26: </span>?- pandemic.  % what is the probability that a pandemic arises?
<span class="linenr">27: </span>% expected result 0.357
<span class="linenr">28: </span>
<span class="linenr">29: </span>*/
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc0b0cb2" class="outline-3">
<h3 id="orgc0b0cb2"><span class="section-number-3">4.2.</span> Load the library</h3>
<div class="outline-text-3" id="text-4-2">
</div>
<div id="outline-container-orgaedacef" class="outline-4">
<h4 id="orgaedacef"><span class="section-number-4">4.2.1.</span> Step 1</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
Start swipl in the same directory where <code>epidemic.cpl</code> lives
</p>

<div class="org-src-container">
<pre class="src src-bash"><span class="linenr">1: </span>swipl
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc1539d4" class="outline-4">
<h4 id="orgc1539d4"><span class="section-number-4">4.2.2.</span> Step 2</h4>
<div class="outline-text-4" id="text-4-2-2">
<p>
Then type into the <code>swipl</code> console "<code>[epidemic].</code>" and press enter.
</p>

<div class="org-src-container">
<pre class="src src-text"><span class="linenr">1: </span>[epidemic].
</pre>
</div>

<p>
This should load the <code>epidemic.cpl</code> program.
</p>
</div>
</div>

<div id="outline-container-org4eae7ef" class="outline-4">
<h4 id="org4eae7ef"><span class="section-number-4">4.2.3.</span> Step 3</h4>
<div class="outline-text-4" id="text-4-2-3">
<p>
Then to calculate the probability of an epidemic, type the following into the console and press enter:
</p>

<div class="org-src-container">
<pre class="src src-prolog"><span class="linenr">1: </span>prob(epidemic,P).
</pre>
</div>
</div>
</div>

<div id="outline-container-org0b70bb1" class="outline-4">
<h4 id="org0b70bb1"><span class="section-number-4">4.2.4.</span> Output</h4>
<div class="outline-text-4" id="text-4-2-4">
<div class="org-src-container">
<pre class="src src-text"><span class="linenr"> 1: </span>Welcome to SWI-Prolog (threaded, 64 bits, version 8.0.2)
<span class="linenr"> 2: </span>SWI-Prolog comes with ABSOLUTELY NO WARRANTY. This is free software.
<span class="linenr"> 3: </span>Please run ?- license. for legal details.
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>For online help and background, visit http://www.swi-prolog.org
<span class="linenr"> 6: </span>For built-in help, use ?- help(Topic). or ?- apropos(Word).
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span>?- [epidemic].
<span class="linenr"> 9: </span>true.
<span class="linenr">10: </span>
<span class="linenr">11: </span>?- prob(epidemic,P).
<span class="linenr">12: </span>P = 0.42 .
<span class="linenr">13: </span>
<span class="linenr">14: </span>?-
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc0ea904" class="outline-2">
<h2 id="orgc0ea904"><span class="section-number-2">5.</span> cplint Glossary</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-text"><span class="linenr"> 1: </span>cpl
<span class="linenr"> 2: </span>cplint
<span class="linenr"> 3: </span>    [#prolog]
<span class="linenr"> 4: </span>    [prolog package]
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span>    cplint is a package for prolog that is
<span class="linenr"> 7: </span>    used for probabilistic logic programming.
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span>prob/2
<span class="linenr">10: </span>    [#cplint]
<span class="linenr">11: </span>    [predicate]
<span class="linenr">12: </span>
<span class="linenr">13: </span>    prob is a predicate for the cplint that
<span class="linenr">14: </span>    takes 2 arguments.
<span class="linenr">15: </span>
<span class="linenr">16: </span>    Computes the probability of an atom.
<span class="linenr">17: </span>
<span class="linenr">18: </span>        a:0.2:-
<span class="linenr">19: </span>            prob(b,P),
<span class="linenr">20: </span>            P &gt; 0.2.
<span class="linenr">21: </span>
<span class="linenr">22: </span>    Read about it:
<span class="linenr">23: </span>    - http://friguzzi.github.io/cplint/_build/html/index.html
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-06-17 Mon 00:00</p>
<p class="author">Author: Fani</p>
<p class="date">Created: 2024-06-17 Mon 16:21</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>